$.fn.ketchup.messages = {
  'required':     'Необходимо заполнить',
  'minlength':    'Минимальная длина $arg1',
  'maxlength':    'Максимальная длина $arg1',
  'rangelength':  'Длина должна быть от $arg1 до $arg2',
  'min':          'Не должно быть меньше $arg1',
  'max':          'Не должно превышать $arg1',
  'range':        'Должно быть от $arg1 до $arg2',
  'number':       'Поле должно иметь числовое значение',
  'digits':       'Допустимы только целые числа',
  'email':        'Введите корректный E-Mail',
  'url':          'Введите корректный URL',
  'username':     'Спецсимволы не допустимы',
  'match':        'Должно совпадать с полем выше',
  'date':         'Введите корректную дату',
  'minselect':    'Выберите хотябы $arg1 опцию',
  'maxselect':    'Не больше $arg1 опций',
  'rangeselect':  'Выберите от $arg1 до $arg2 опций'
};